mysource/public-notes-org/2024-02-09-org-mode-tables.org
#+TITLE: org-mode tables
#+DESCRIPTION: 
#+AUTHOR: cissic 
#+DATE: <2024-02-09 Fri>
#+TAGS: 
#+OPTIONS: -:nil

* TODO org-mode tables
:PROPERTIES:
:PRJ-DIR: ./2024-02-09-org-mode-tables/
:END:

** Problem description
- Elisp list can be intepreted as a one-row table:
#+begin_src elisp
    '("aaaaa ad" 
     " aaa  " 
     "bbb  ")
#+end_src

#+RESULTS:
| aaaaa ad | aaa | bbb |

- List of strings with newline character can be interpreted as one-column table:
#+begin_src elisp
    '("aaaaa ad
    "
     " aaa
    "
     "bbb
  ")
#+end_src

#+RESULTS:
| aaaaa ad |
| aaa      |
| bbb      |

- new line character inserted here and there instructs org to start new
  row of the table. If there is not enough elements in the current row
  than the number of elements in a row with maximum number of elements
  then org creates blank cells.

  - example 1
#+begin_src elisp
    '("a11 " "a12" "\n"
     " a21"        "\n"    "a31"
     "a32  " )
#+end_src

#+RESULTS:
| a11 | a12 |
| a21 |     |
| a31 | a32 |


  - example 2
#+begin_src elisp
    '("a11 " " "  "a12" "\n"
     " a21"        "\n"    "a31"
     "a32  " )
#+end_src

#+RESULTS:
| a11 |     | a12 |
| a21 |     |     |
| a31 | a32 |     |

- you can also insert next column by adding =|= in a string

#+begin_src elisp
    '("a11 |    a12 " "a13"  "\n"
     " a21" "a22 | a23"  "\n"
     "a32  " )
#+end_src

#+RESULTS:
| a11 | a12 | a13 |
| a21 | a22 | a23 |
| a32 |     |     |

- ways of adding horizontal lines
#+begin_src elisp
  '("a11 |  a12 " "a13"  "\n"
    "--|--|--" "\n"
   " a21" "a22 | a23"  "\n"
    "--|" "--|" "--" "\n"
   "a32  " "\n"
   "----+-------------+----" "\n"
   "a41" "\n"
   "-+-+-" "\n"
   "a51" "\n"
   " + + " "\n"
   )
#+end_src

#+RESULTS:
| a11 | a12 | a13 |
|-----+-----+-----|
| a21 | a22 | a23 |
|-----+-----+-----|
| a32 |     |     |
|-----+-----+-----|
| a41 |     |     |
|-----+-----+-----|
| a51 |     |     |
| + + |     |     |

